{
  "irVersion": "1.0",
  "project": "shap-go",
  "repository": "https://github.com/plexusone/shap-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-03-21",
      "highlights": [
        { "description": "DeepSHAP explainer - efficient SHAP values for neural networks using DeepLIFT" },
        { "description": "GradientSHAP explainer - Expected Gradients method using numerical differentiation" },
        { "description": "PartitionSHAP explainer - hierarchical Owen values for feature groupings" },
        { "description": "AdditiveSHAP explainer - exact SHAP for Generalized Additive Models (GAMs)" },
        { "description": "TreeSHAP interaction values - pairwise feature interaction computation" },
        { "description": "CatBoost model support with JSON model parser" },
        { "description": "ONNX-ML TreeEnsemble parser - load tree models directly from ONNX format" },
        { "description": "Parallel batch explanation API with progress tracking" },
        { "description": "Batched model predictions for efficient coalition evaluation" },
        { "description": "Confidence intervals for sampling-based SHAP methods" },
        { "description": "ONNX graph parsing and ActivationSession for intermediate layer access" }
      ],
      "added": [
        { "description": "DeepSHAP explainer (`explainer/deepshap`) with DeepLIFT rescale rule", "commit": "b4f6edb" },
        { "description": "Attribution rules for Dense, ReLU, Sigmoid, Tanh, Softmax, Add, Identity layers", "commit": "b4f6edb" },
        { "description": "Backward propagation engine for DeepSHAP attribution", "commit": "b4f6edb" },
        { "description": "GradientSHAP explainer (`explainer/gradient`) with Expected Gradients algorithm", "commit": "0b2d952" },
        { "description": "Numerical gradient computation using central finite differences", "commit": "0b2d952" },
        { "description": "GradientSHAP configuration options (WithEpsilon, WithNoiseStdev, WithLocalSmoothing)", "commit": "0b2d952" },
        { "description": "PartitionSHAP explainer (`explainer/partition`) with hierarchical Owen values", "commit": "e319196" },
        { "description": "Node type for defining feature hierarchies", "commit": "e319196" },
        { "description": "Flat mode fallback when no hierarchy is provided", "commit": "e319196" },
        { "description": "AdditiveSHAP explainer (`explainer/additive`) for Generalized Additive Models", "commit": "8f48715" },
        { "description": "Exact SHAP computation for additive models with O(nĂ—b) complexity", "commit": "8f48715" },
        { "description": "TreeSHAP interaction values via `ExplainInteractions()` method", "commit": "7ea74a7" },
        { "description": "InteractionResult type with symmetric interaction matrix and helper methods", "commit": "7ea74a7" },
        { "description": "CatBoost JSON model parser (`ParseCatBoostJSON`, `LoadCatBoostModel`)", "commit": "953238c" },
        { "description": "Support for CatBoost oblivious (symmetric) trees with float and categorical features", "commit": "953238c" },
        { "description": "LightGBM text format parser (`ParseLightGBMText`, `LoadLightGBMTextModel`)", "commit": "c3da7c9" },
        { "description": "ONNX-ML TreeEnsemble parser (`ParseONNXTreeEnsemble`, `ParseONNXTreeEnsembleFromBytes`)", "commit": "eccfbaf" },
        { "description": "Support for TreeEnsembleRegressor and TreeEnsembleClassifier ONNX-ML operators", "commit": "eccfbaf" },
        { "description": "ONNX graph parsing (`model/onnx/graph.go`) using gonnx protobuf", "commit": "fde028e" },
        { "description": "ActivationSession (`model/onnx/activation_session.go`) for intermediate output capture", "commit": "fde028e" },
        { "description": "ONNX types (`model/onnx/types.go`) for LayerType, NodeInfo, GraphInfo", "commit": "fde028e" },
        { "description": "ExplainBatchParallel() generic parallel batch function for any explainer", "commit": "772ebec" },
        { "description": "ExplainBatchWithProgress() batch function with progress callback", "commit": "772ebec" },
        { "description": "BatchConfig with Workers and StopOnError options", "commit": "772ebec" },
        { "description": "`WithBatchedPredictions()` config option for efficient batched model inference", "commit": "cb747d8" },
        { "description": "Batched coalition evaluation in KernelSHAP, ExactSHAP, PermutationSHAP, SamplingSHAP", "commit": "cb747d8" },
        { "description": "Confidence intervals for SamplingSHAP, PermutationSHAP, and GradientSHAP via `WithConfidenceLevel()`", "commit": "8aca07d" },
        { "description": "ConfidenceIntervals type in explanation package with Lower, Upper, StandardErrors", "commit": "8aca07d" },
        { "description": "GetConfidenceInterval() and HasConfidenceIntervals() helper methods", "commit": "8aca07d" },
        { "description": "ZScoreForConfidenceLevel() helper for common confidence levels (90%, 95%, 99%)", "commit": "8aca07d" },
        { "description": "DeepSHAP example (`examples/deepshap`) with neural network MLP", "commit": "c68b826" },
        { "description": "GradientSHAP example (`examples/gradientshap`)", "commit": "c68b826" },
        { "description": "Multi-class classification example (`examples/multiclass`)", "commit": "c68b826" },
        { "description": "ONNX basic example (`examples/onnx_basic`) with KernelSHAP", "commit": "c68b826" },
        { "description": "Expected output documentation for all 12 examples", "commit": "a9b26e3" },
        { "description": "Examples README with overview and external model links", "commit": "a9b26e3" }
      ],
      "documentation": [
        { "description": "DeepSHAP explainer guide (`docs/explainers/deepshap.md`)", "commit": "d2be9d3" },
        { "description": "GradientSHAP explainer guide (`docs/explainers/gradientshap.md`)", "commit": "d2be9d3" },
        { "description": "PartitionSHAP explainer guide (`docs/explainers/partitionshap.md`)", "commit": "d2be9d3" },
        { "description": "AdditiveSHAP explainer guide (`docs/explainers/additiveshap.md`)", "commit": "d2be9d3" },
        { "description": "Updated explainer overview with all new explainers", "commit": "d2be9d3" },
        { "description": "Background data selection guide (`docs/guides/background-data.md`)", "commit": "d38e463" },
        { "description": "Updated API reference with comprehensive docs for all explainers", "commit": "d38e463" },
        { "description": "Udemy-style LMS presentation with 7 sections", "commit": "ac34355" },
        { "description": "Reorder explainers table by common usage", "commit": "1d31beb" },
        { "description": "Add coverage badge to README (80%)", "commit": "a4ca1c1" }
      ],
      "tests": [
        { "description": "DeepSHAP explainer unit tests with analytical solutions", "commit": "b4f6edb" },
        { "description": "Attribution rule tests for all layer types", "commit": "b4f6edb" },
        { "description": "Propagation engine tests", "commit": "b4f6edb" },
        { "description": "GradientSHAP tests (linear, nonlinear, parallel, confidence intervals)", "commit": "0b2d952" },
        { "description": "GradientSHAP validation tests with analytically derived expected values", "commit": "0b2d952" },
        { "description": "PartitionSHAP tests (hierarchy validation, local accuracy, flat mode, batch)", "commit": "e319196" },
        { "description": "AdditiveSHAP tests (linear, nonlinear, single feature, batch, error handling)", "commit": "8f48715" },
        { "description": "TreeSHAP interaction value tests (symmetry, SHAP consistency, local accuracy)", "commit": "7ea74a7" },
        { "description": "CatBoost parser tests (simple, single leaf, multiple trees, depth 3, categorical)", "commit": "953238c" },
        { "description": "LightGBM text parser tests (simple, multiple trees, deeper trees, edge cases)", "commit": "c3da7c9" },
        { "description": "ONNX-ML tree parser tests (simple, multiple trees, end-to-end with TreeSHAP)", "commit": "eccfbaf" },
        { "description": "ONNX graph parsing tests with protobuf model construction", "commit": "fde028e" },
        { "description": "ActivationSession tests for helper methods", "commit": "fde028e" },
        { "description": "ONNX types tests (GraphInfo methods, LayerType mapping, Config defaults)", "commit": "fde028e" },
        { "description": "Parallel batch tests (basic, progress, error handling, context cancellation)", "commit": "772ebec" },
        { "description": "Batched prediction tests for KernelSHAP, ExactSHAP, PermutationSHAP, SamplingSHAP", "commit": "cb747d8" },
        { "description": "Confidence interval tests for sampling and permutation explainers", "commit": "8aca07d" }
      ],
      "build": [
        { "description": "Add gonnx dependency (`github.com/advancedclimatesystems/gonnx@v1.1.0`)", "commit": "23603d9" },
        { "description": "Bump actions/checkout from 4 to 6", "commit": "ff52e6b" },
        { "description": "Bump actions/upload-pages-artifact from 3 to 4", "commit": "fbce366" },
        { "description": "Bump actions/setup-go from 5 to 6", "commit": "08ecab3" },
        { "description": "Bump actions/setup-python from 5 to 6", "commit": "2915bff" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2025-03-15",
      "highlights": [
        { "description": "KernelSHAP explainer - model-agnostic SHAP values using weighted linear regression" },
        { "description": "ExactSHAP explainer - brute-force exact Shapley values for small feature sets" },
        { "description": "Markdown report generation example for documentation and compliance" },
        { "description": "Upgraded to gocharts v2.27.0 with ChartIR refactoring" }
      ],
      "added": [
        { "description": "KernelSHAP explainer (`explainer/kernel`) with SHAP kernel weights", "commit": "ce314a0" },
        { "description": "ExactSHAP explainer (`explainer/exact`) with O(n*2^n) brute-force algorithm" },
        { "description": "KernelSHAP example (`examples/kernelshap`)", "commit": "7a67815" },
        { "description": "Markdown report example (`examples/markdown_report`)", "commit": "7a67815" }
      ],
      "changed": [
        { "description": "Refactor render package to use `gocharts/v2/charts/chartir` for ChartIR types", "commit": "4e79375" }
      ],
      "fixed": [
        { "description": "Add nolint:gosec directives for deterministic test seeds", "commit": "d23e6d8" },
        { "description": "Fix gofmt formatting issues", "commit": "f0083ba" }
      ],
      "documentation": [
        { "description": "KernelSHAP explainer guide and overview documentation", "commit": "0183286" },
        { "description": "ExactSHAP explainer guide with complexity analysis" }
      ],
      "tests": [
        { "description": "Comprehensive tests for `internal/rand` package", "commit": "d2b0679" },
        { "description": "Python SHAP validation test data for KernelSHAP", "commit": "ce314a0" },
        { "description": "ExactSHAP tests including linear, nonlinear, and edge cases" },
        { "description": "ExactSHAP comparison tests with mathematically verified Shapley values" }
      ],
      "infrastructure": [
        { "description": "Add KernelSHAP tests to CI workflow", "commit": "8731544" }
      ],
      "build": [
        { "description": "Upgrade gocharts dependency to v2.27.0", "commit": "0ea65d4" },
        { "description": "Add TASKS.md and update .gitignore", "commit": "19fdd3f" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2025-03-14",
      "highlights": [
        { "description": "TreeSHAP for XGBoost/LightGBM - exact SHAP values 40-100x faster than permutation methods" },
        { "description": "LinearSHAP for linear models - O(d) closed-form SHAP computation" },
        { "description": "Comprehensive MkDocs documentation site with guides and API reference" }
      ],
      "breaking": [
        { "description": "`Masker.Mask()` now returns `([]float64, error)` instead of panicking on dimension mismatches", "commit": "8f146ee" }
      ],
      "upgradeGuide": [
        { "description": "Add error handling to all `Mask()` and `MaskWithBackground()` calls" },
        { "description": "Handle new sentinel errors: `ErrInstanceFeatureMismatch`, `ErrMaskFeatureMismatch`, `ErrBackgroundFeatureMismatch`" }
      ],
      "added": [
        { "description": "TreeSHAP explainer (`explainer/tree`) with O(TLDÂ˛) algorithm for tree ensembles", "commit": "44c485b" },
        { "description": "XGBoost JSON model parser via `tree.LoadXGBoostModel()`", "commit": "44c485b" },
        { "description": "LightGBM JSON model parser via `tree.LoadLightGBMModel()`", "commit": "44c485b" },
        { "description": "LinearSHAP explainer (`explainer/linear`) with closed-form solution", "commit": "b54aa05" },
        { "description": "TreeSHAP example (`examples/treeshap`)", "commit": "31f89ca" },
        { "description": "LinearSHAP example (`examples/linearshap`)", "commit": "31f89ca" },
        { "description": "SamplingSHAP example (`examples/sampling`)", "commit": "31f89ca" },
        { "description": "Batch processing example (`examples/batch`)", "commit": "31f89ca" },
        { "description": "Visualization example (`examples/visualization`)", "commit": "31f89ca" }
      ],
      "changed": [
        { "description": "Masker interface returns errors instead of panicking", "commit": "8f146ee", "breaking": true }
      ],
      "fixed": [
        { "description": "Resolve CI lint errors (gofmt, gosec)", "commit": "5ef4049" }
      ],
      "documentation": [
        { "description": "MkDocs documentation site with explainer guides, API reference, and model integration docs", "commit": "e961b18" },
        { "description": "Release notes for v0.1.0 and v0.2.0", "commit": "f53548b" },
        { "description": "Updated README with TreeSHAP usage examples and feature matrix", "commit": "e961b18" }
      ],
      "tests": [
        { "description": "ONNX session tests", "commit": "ce2a0ea" },
        { "description": "Python SHAP comparison test data for TreeSHAP validation", "commit": "9401f41" },
        { "description": "TreeSHAP benchmarks and coverage tests", "commit": "44c485b" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions CI workflow with Go 1.21/1.22/1.23 matrix", "commit": "ec5d044" },
        { "description": "GitHub Actions docs workflow for MkDocs deployment", "commit": "ec5d044" },
        { "description": "Makefile with test, lint, and testdata generation targets", "commit": "612808b" }
      ],
      "build": [
        { "description": "Add `.gitignore` for build artifacts and Python venv", "commit": "612808b" },
        { "description": "Exclude dupl linter for test files in golangci config", "commit": "1e11f34" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-03-09",
      "highlights": [
        { "description": "Initial release of SHAP-Go with PermutationSHAP and SamplingSHAP explainers" },
        { "description": "ONNX Runtime integration for model inference" },
        { "description": "ChartIR visualization output for waterfall, bar, and beeswarm charts" }
      ],
      "added": [
        { "description": "Core explanation types (`explanation/`) for SHAP value representation", "commit": "843f6a1" },
        { "description": "Model interface with `FuncModel` wrapper (`model/`)", "commit": "8b44a15" },
        { "description": "ONNX Runtime integration (`model/onnx/`)", "commit": "b6b75f6" },
        { "description": "Feature masking strategies (`masker/`) with `IndependentMasker`", "commit": "d95f790" },
        { "description": "Background dataset management (`background/`)", "commit": "3bff392" },
        { "description": "Explainer interface and configuration (`explainer/`)", "commit": "74b8179" },
        { "description": "PermutationSHAP with antithetic sampling for variance reduction", "commit": "1b4e93d" },
        { "description": "SamplingSHAP for Monte Carlo approximation", "commit": "821b1c1" },
        { "description": "Render package with ChartIR output formats", "commit": "50a6ebb" },
        { "description": "Permutation generation utilities (`internal/rand/`)", "commit": "30945d7" },
        { "description": "Linear model example (`examples/linear`)", "commit": "6440da0" }
      ],
      "documentation": [
        { "description": "Comprehensive README with usage examples and feature matrix", "commit": "4cfab99" }
      ]
    }
  ]
}
